### Importamos librerías

In [1]:
import sqlite3
import pandas as pd

### Creamos la base de datos

In [2]:
import os

In [4]:
# Conectamos con la base de datos
connection = sqlite3.connect("data/crear_db.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

### Creando Tablas

In [124]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [6]:
#Tabla Cervezas
query = '''
CREATE TABLE Cervezas (
    CodC VARCHAR(2),
    Envase VARCHAR(32),
    Capacidad FLOAT(3),
    Stock INT(5),
    PRIMARY KEY (CodC)
)
'''

crsr.execute(query)

In [13]:
tables = crsr.execute("SELECT name FROM sqlite_master WHERE type = 'table'")
for i in tables:
    print(i[0])

Cervezas

In [14]:
#Tabla Bares
query = '''
CREATE TABLE Bares (
    CodB VARCHAR(3),
    Nombre VARCHAR(32),
    Cif VARCHAR(32),
    Localidad VARCHAR(32),
    PRIMARY KEY (CodB)
)
'''

crsr.execute(query)

In [15]:
#Tabla Empleados
query = '''
CREATE TABLE Empleados (
    CodE VARCHAR(2),
    Nombre VARCHAR(32),
    Sueldo FLOAT(2),
    PRIMARY KEY (CodE)
)
'''

crsr.execute(query)

In [16]:
#Tabla Reparto
query = '''
CREATE TABLE Reparto (
    CodE VARCHAR(3),
    CodB VARCHAR(3),
    CodC VARCHAR(3),
    Fecha DATE,
    Cantidad INTEGER(3)
)
'''

crsr.execute(query)

In [17]:
#Mirando el contenido de la tabla reparto
query = '''
SELECT * 
FROM Reparto
'''

sql_query(query)

Empty DataFrame
Columns: [CodE, CodB, CodC, Fecha, Cantidad]
Index: []

### Rellenamos los valores de las tablas

In [18]:
#Tabla Cervezas
query = '''INSERT INTO Cervezas (
    CodC,
    Envase,
    Capacidad,
    Stock
)
VALUES
    (
        '01',
        'Botella',
        0.2,
        3600
    ),
    (
        '02',
        'Botella',
        0.33,
        1200
    ),
    (
        '03',
        'Lata',
        0.33,
        2400
    ),
    
    (
    
        '04',
        'Botella',
        1,
        288
    ),
    
    (
    
        '05',
        'Barril',
        60,
        30
    );'''

crsr.execute(query)

In [19]:
#Miramos valores tabla Cervezas
query = '''SELECT * FROM Cervezas'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.33   1200
2   03     Lata       0.33   2400
3   04  Botella       1.00    288
4   05   Barril      60.00     30

In [20]:
#Tabla Bares
query = '''INSERT INTO Bares (
    CodB,
    Nombre,
    Cif,
    Localidad
)
VALUES
    (
        '001',
        'Stop',
        '11111111X',
        'Villa Botijo'
    ),
    (
        '002',
        'Las Vegas',
        '22222222Y',
       'Villa Botijo'
    ),
    (
        '003',
        'Club Social',
        'Sin valor',
        'Las Ranas'
    ),
    
    (
    
        '004',
        'Otra Ronda',
        '33333333Z',
        'La Esponja'
    )
    ;'''

crsr.execute(query)

In [21]:
#Miramos valores tabla Bares
query = '''SELECT * FROM Bares'''
sql_query(query)

  CodB       Nombre        Cif     Localidad
0  001         Stop  11111111X  Villa Botijo
1  002    Las Vegas  22222222Y  Villa Botijo
2  003  Club Social  Sin valor     Las Ranas
3  004   Otra Ronda  33333333Z    La Esponja

In [22]:
#Tabla empleados
query = '''INSERT INTO Empleados (
    CodE,
    Nombre,
    Sueldo
)
VALUES
    (
        '1',
        'Prudencio Caminero',
        120000
    ),
    (
        '2',
        'Vicente Merario',
        110000
    ),
    (
        '3',
        'Valentin Siempre',
        100000
    )
    ;'''

crsr.execute(query)

In [23]:
#Miramos valores tabla Empleados
query = '''SELECT * FROM Empleados'''
sql_query(query)

  CodE              Nombre    Sueldo
0    1  Prudencio Caminero  120000.0
1    2     Vicente Merario  110000.0
2    3    Valentin Siempre  100000.0

In [24]:
#Tabla Reparto
query = '''INSERT INTO Reparto (
    CodE,
    CodB,
    CodC,
    Fecha,
    Cantidad
)
VALUES
    ('1', '001', '01', '10/21/05', 240), 
    ('1', '001', '02', '10/21/05', 48),
    ('1', '002', '03', '10/22/05', 60),
    ('1', '004', '05', '10/22/05', 4),
    ('2', '002', '03', '10/22/05', 48),
    ('2', '002', '05', '10/23/05', 2),
    ('2', '004', '01', '10/23/05', 480),
    ('2', '004', '02', '10/24/05', 72),
    ('3', '003', '03', '10/24/05', 48),
    ('3', '003', '04', '10/25/05', 20)
    ;'''

crsr.execute(query)

In [25]:
#Miramos valores tabla Reparto
query = '''SELECT * FROM Reparto'''
sql_query(query)

  CodE CodB CodC     Fecha  Cantidad
0    1  001   01  10/21/05       240
1    1  001   02  10/21/05        48
2    1  002   03  10/22/05        60
3    1  004   05  10/22/05         4
4    2  002   03  10/22/05        48
5    2  002   05  10/23/05         2
6    2  004   01  10/23/05       480
7    2  004   02  10/24/05        72
8    3  003   03  10/24/05        48
9    3  003   04  10/25/05        20

In [28]:
tables = crsr.execute('''SELECT name FROM sqlite_master WHERE type = "table"''')

In [29]:
for i in tables:
    print(i[0])

Cervezas
Bares
Empleados
Reparto

### Ejecutamos las queries

In [54]:
sql_query("SELECT Fecha FROM Reparto")

      Fecha
0  10/21/05
1  10/21/05
2  10/22/05
3  10/22/05
4  10/22/05
5  10/23/05
6  10/23/05
7  10/24/05
8  10/24/05
9  10/25/05

#### 1. Obtener el nombre de los empleados que hayan repartido al bar Stop durante la semana del 17 al 23 de octubre de 2005.

In [56]:
#Query 1

query = '''SELECT Empleados.Nombre, Bares.Nombre, Reparto.Fecha 
            FROM Empleados
            INNER JOIN Reparto
            ON Empleados.CodE = Reparto.CodE
            INNER JOIN Bares
            ON Reparto.CodB = Bares.CodB
            WHERE Reparto.Fecha BETWEEN "10/17/05" AND "10/23/05"'''

sql_query(query)

               Nombre      Nombre     Fecha
0  Prudencio Caminero        Stop  10/21/05
1  Prudencio Caminero        Stop  10/21/05
2  Prudencio Caminero   Las Vegas  10/22/05
3  Prudencio Caminero  Otra Ronda  10/22/05
4     Vicente Merario   Las Vegas  10/22/05
5     Vicente Merario   Las Vegas  10/23/05
6     Vicente Merario  Otra Ronda  10/23/05

#### 2. Obtener el Cif y nombre de los bares a los que se ha repartido cerveza de tipo Botella y capacidad inferior a 1 litro, ordenados por localidad.

In [57]:
sql_query("SELECT * FROM Bares")

  CodB       Nombre        Cif     Localidad
0  001         Stop  11111111X  Villa Botijo
1  002    Las Vegas  22222222Y  Villa Botijo
2  003  Club Social  Sin valor     Las Ranas
3  004   Otra Ronda  33333333Z    La Esponja

In [58]:
sql_query("SELECT * FROM Cervezas")

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.33   1200
2   03     Lata       0.33   2400
3   04  Botella       1.00    288
4   05   Barril      60.00     30

In [61]:
#Query 2

query = '''SELECT Bares.Cif, 
                Bares.Nombre, 
                Cervezas.Envase, 
                Cervezas.Capacidad, 
                Bares.Localidad
            FROM Bares
            INNER JOIN Reparto
            ON Bares.CodB = Reparto.CodB
            INNER JOIN Cervezas
            ON Reparto.CodC = Cervezas.CodC
            WHERE Cervezas.Envase = "Botella" AND Cervezas.Capacidad < 1
            ORDER BY Localidad
            '''

sql_query(query)

         Cif      Nombre   Envase  Capacidad     Localidad
0  33333333Z  Otra Ronda  Botella       0.20    La Esponja
1  33333333Z  Otra Ronda  Botella       0.33    La Esponja
2  11111111X        Stop  Botella       0.20  Villa Botijo
3  11111111X        Stop  Botella       0.33  Villa Botijo

#### 3. Obtener los repartos (nombre del bar, envase y capacidad de la bebida, fecha y cantidad) realizados por Prudencio Camionero.

In [68]:
#Query 3
query = '''SELECT Bares.Nombre, 
                Cervezas.Envase, 
                Cervezas.Capacidad, 
                Reparto.Fecha, 
                Reparto.Cantidad,
                Empleados.Nombre
            FROM Bares
            INNER JOIN Reparto
            ON Bares.CodB = Reparto.CodB
            INNER JOIN Cervezas
            ON Reparto.CodC = Cervezas.CodC
            INNER JOIN Empleados
            ON Reparto.CodE = Empleados.CodE
            WHERE Empleados.Nombre = "Prudencio Caminero"'''

sql_query(query)

       Nombre   Envase  Capacidad     Fecha  Cantidad              Nombre
0        Stop  Botella       0.20  10/21/05       240  Prudencio Caminero
1        Stop  Botella       0.33  10/21/05        48  Prudencio Caminero
2   Las Vegas     Lata       0.33  10/22/05        60  Prudencio Caminero
3  Otra Ronda   Barril      60.00  10/22/05         4  Prudencio Caminero

#### 4. Obtener los bares a los que se les ha repartido envases de tipo botella y capacidad 0.2 ó 0.33.

In [72]:
#Query 4

query = '''SELECT Bares.Nombre, 
                Cervezas.Envase, 
                Cervezas.Capacidad
            FROM Bares
            INNER JOIN Reparto
            ON Bares.CodB = Reparto.CodB
            INNER JOIN Cervezas
            ON Reparto.CodC = Cervezas.CodC
            WHERE Cervezas.Envase = "Botella" 
                    AND (Cervezas.Capacidad = 0.2 OR Cervezas.Capacidad = 0.33)'''

sql_query(query)

       Nombre   Envase  Capacidad
0        Stop  Botella       0.20
1        Stop  Botella       0.33
2  Otra Ronda  Botella       0.20
3  Otra Ronda  Botella       0.33

#### 5. Nombre de los empleados que han repartido a los bares "Stop" y "Las Vegas" cervezas con envase botella.

In [76]:
#Query 5

query = '''SELECT DISTINCT Empleados.Nombre AS Empleado, 
                    Bares.Nombre AS Bar, 
                    Cervezas.Envase
            FROM Empleados
            INNER JOIN Reparto
            ON Empleados.CodE = Reparto.CodE
            INNER JOIN Bares
            ON Reparto.CodB = Bares.CodB
            INNER JOIN Cervezas
            ON Reparto.CodC = Cervezas.CodC
            WHERE Bares.Nombre IN ("Stop", "Las Vegas") AND Cervezas.Envase = "Botella"'''

sql_query(query)

             Empleado   Bar   Envase
0  Prudencio Caminero  Stop  Botella

#### 6. Obtener el nombre y número de viajes que ha realizado cada empleado fuera de Villa Botijo.

In [80]:
#Query 6

query = '''SELECT Empleados.Nombre,
                    COUNT(Bares.Localidad)
            FROM Empleados
            INNER JOIN Reparto
            ON Empleados.CodE = Reparto.CodE
            INNER JOIN Bares
            ON Bares.CodB = Reparto.CodB
            WHERE Bares.Localidad != "Villa Botijo"
            GROUP BY Empleados.Nombre 
                    '''

sql_query(query)

               Nombre  COUNT(Bares.Localidad)
0  Prudencio Caminero                       1
1    Valentin Siempre                       2
2     Vicente Merario                       2

#### 7. Obtener el nombre y localidad del bar que más litros de cerveza ha comprado.

In [87]:
#Query 7

query = '''SELECT Bares.Nombre, 
                    Bares.Localidad, 
                    SUM(Reparto.Cantidad * Cervezas.Capacidad) AS LitrosTotales
            FROM Bares
            INNER JOIN Reparto
            ON Bares.CodB = Reparto.CodB
            INNER JOIN Cervezas
            ON Reparto.CodC = Cervezas.CodC
            GROUP BY Bares.Nombre
            ORDER BY LitrosTotales
            DESC
            LIMIT 1
                    '''

sql_query(query)

       Nombre   Localidad  LitrosTotales
0  Otra Ronda  La Esponja         359.76

#### 8. Obtener los bares que han adquirido todos los tipos de cerveza con envase de botella y capacidad menor que 1 litro.

In [90]:
#Query 8

query = '''SELECT DISTINCT Bares.Nombre, 
                    Cervezas.Envase
            FROM Bares
            INNER JOIN Reparto
            ON Bares.CodB = Reparto.CodB
            INNER JOIN Cervezas
            ON Cervezas.CodC = Reparto.Codc
            WHERE Cervezas.Envase = "Botella"'''

sql_query(query)

        Nombre   Envase
0         Stop  Botella
1   Otra Ronda  Botella
2  Club Social  Botella

#### 9. Subir un 5% el sueldo del empleado que más días haya trabajado.

In [105]:
#Query 9

query = '''SELECT DISTINCT Reparto.Fecha, Empleados.Nombre
            FROM Empleados
            INNER JOIN Reparto
            ON Empleados.CodE = Reparto.CodE
            GROUP BY Empleados.Nombre
            '''
sql_query(query)

      Fecha              Nombre
0  10/21/05  Prudencio Caminero
1  10/24/05    Valentin Siempre
2  10/22/05     Vicente Merario

In [120]:
#Con Sub-Query

query = '''SELECT COUNT(Fecha) AS Dias, Nombre FROM (SELECT DISTINCT Reparto.Fecha, Empleados.Nombre
            FROM Reparto
            INNER JOIN Empleados
            ON Reparto.CodE = Empleados.CodE)
            GROUP BY Nombre
            ORDER BY Dias DESC
            LIMIT 1
            '''
sql_query(query)

   Dias           Nombre
0     3  Vicente Merario

In [127]:
query = '''UPDATE Empleados
            SET Sueldo = Sueldo + (Sueldo * 0.05)
            WHERE Nombre = "Vicente Merario" '''
crsr.execute(query)

In [128]:
sql_query('''SELECT * FROM Empleados''')

  CodE              Nombre    Sueldo
0    1  Prudencio Caminero  120000.0
1    2     Vicente Merario  115500.0
2    3    Valentin Siempre  100000.0

In [ ]:
# Sin Sub-Query
query = '''SELECT DISTINCT Empleados.Nombre,  
                COUNT (DISTINCT (Reparto.Fecha)) AS NDias,
                Reparto.Fecha

            FROM Empleados
            INNER JOIN Reparto
            ON Empleados.CodE = Reparto.CodE
            GROUP BY Empleados.Nombre
            ORDER BY NDias DESC
            '''

sql_query(query)

#### 10. Insertar un nuevo reparto del empleado “Vicente Merario” al bar “Stop” de 48 cervezas de tipo lata el día 10/26/05.

In [129]:
#Query 10

sql_query("SELECT * FROM Empleados")

  CodE              Nombre    Sueldo
0    1  Prudencio Caminero  120000.0
1    2     Vicente Merario  115500.0
2    3    Valentin Siempre  100000.0

In [130]:
sql_query("SELECT * FROM Bares")

  CodB       Nombre        Cif     Localidad
0  001         Stop  11111111X  Villa Botijo
1  002    Las Vegas  22222222Y  Villa Botijo
2  003  Club Social  Sin valor     Las Ranas
3  004   Otra Ronda  33333333Z    La Esponja

In [132]:
sql_query("SELECT * FROM Reparto")

  CodE CodB CodC     Fecha  Cantidad
0    1  001   01  10/21/05       240
1    1  001   02  10/21/05        48
2    1  002   03  10/22/05        60
3    1  004   05  10/22/05         4
4    2  002   03  10/22/05        48
5    2  002   05  10/23/05         2
6    2  004   01  10/23/05       480
7    2  004   02  10/24/05        72
8    3  003   03  10/24/05        48
9    3  003   04  10/25/05        20

In [133]:
sql_query('''SELECT * FROM Cervezas''')

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.33   1200
2   03     Lata       0.33   2400
3   04  Botella       1.00    288
4   05   Barril      60.00     30

In [136]:
query = '''INSERT INTO Reparto (CodE, CodB, CodC, Fecha, Cantidad)
            VALUES (2, "001", "03", "10/26/05", 48)'''

crsr.execute(query)

In [137]:
sql_query('''SELECT * FROM Reparto''')

   CodE CodB CodC     Fecha  Cantidad
0     1  001   01  10/21/05       240
1     1  001   02  10/21/05        48
2     1  002   03  10/22/05        60
3     1  004   05  10/22/05         4
4     2  002   03  10/22/05        48
5     2  002   05  10/23/05         2
6     2  004   01  10/23/05       480
7     2  004   02  10/24/05        72
8     3  003   03  10/24/05        48
9     3  003   04  10/25/05        20
10    2    1    3  10/26/05        48
11    2  001   03  10/26/05        48

### Cerramos la conexión con la base de datos

In [88]:
# ATENCIÓN! Al terminar hay que cerrar la conexión a la DB para que se guarden los cambios!!!!!!
connection.commit()
connection.close()